---
kind: enumMember
id: F:Autodesk.Revit.DB.OpenForeignOption.Open
enum: Autodesk.Revit.DB.OpenForeignOption
source: html/c8247945-7f12-a435-35e0-0879b02d4397.htm
---
# Autodesk.Revit.DB.OpenForeignOption.Open

Do not show any prompt to the user if a foreign file is detected. Proceed to open.